app/controllers/orders_controller.rb

INSERT INTO "orders" ("amount", "created_at", "updated_at", "customer_name") VALUES ($1, $2, $3, $4) RETURNING "id"  [["amount", 750.0], ["created_at", "2018-10-16 03:47:44.690573"], ["updated_at", "2018-10-16 03:47:44.690573"], ["customer_name", "Mickey Mouse"]]
---
  def create
    @order = Order.new(order_params)
    if @order.valid?
      @order.save

SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC
---
  def index
    @orders = Order.order(created_at: :desc)

SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC
---
  def ajax_filter_orders
    if params[:key] == 'all'
      @orders = Order.order(created_at: :desc)