app/controllers/receipts_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @order = Order.find_by(id: params[:order_id])