app/views/receipts/show.html.erb

<ul>
  <%- @order.line_items.each do |li| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 1]]